fastify/load-test/2000-vus

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: ./scripts/load-test-get.js

    duration: -, iterations: -
         vus: 1, max: 2000

    init [----------------------------------------------------------] starting
    ✓ is status 200

    checks.....................: 100.00% ✓ 115121 ✗ 0     
    data_received..............: 17 MB   279 kB/s
    data_sent..................: 9.1 MB  151 kB/s
    http_req_blocked...........: avg=25.01µs min=4.3µs  max=12.11ms  p(90)=12µs    p(95)=18.1µs  p(99)=520.08µs
    http_req_connecting........: avg=15.69µs min=0s     max=12.01ms  p(90)=0s      p(95)=0s      p(99)=452.98µs
  ✓ http_req_duration..........: avg=6.48ms  min=1.08ms max=125.93ms p(90)=10.06ms p(95)=13.32ms p(99)=45.9ms  
    http_req_receiving.........: avg=47.51µs min=18.5µs max=3ms      p(90)=65.4µs  p(95)=76.3µs  p(99)=114.4µs 
    http_req_sending...........: avg=17.44µs min=6.6µs  max=5.96ms   p(90)=24.6µs  p(95)=31.8µs  p(99)=72.08µs 
    http_req_tls_handshaking...: avg=0s      min=0s     max=0s       p(90)=0s      p(95)=0s      p(99)=0s      
    http_req_waiting...........: avg=6.42ms  min=1.04ms max=125.72ms p(90)=9.98ms  p(95)=13.23ms p(99)=45.71ms 
    http_reqs..................: 115121  1918.666871/s
    iteration_duration.........: avg=1s      min=1s     max=1.13s    p(90)=1.01s   p(95)=1.01s   p(99)=1.04s   
    iterations.................: 113129  1885.467156/s
    vus........................: 2000    min=395  max=2000
    vus_max....................: 2000    min=2000 max=2000